# -*- coding: utf-8 -*-
# @Time    : 2022/1/2 16:37
# @Author  : Rey
# @FileName: 3d_vis.py
# @Software: PyCharm



import numpy as np
import matplotlib.pyplot as plt
import mpl_toolkits.mplot3d






x = np.array([-59.484,-179.2623042,-247.7853881,-295.8533366,60.29335638,
              114.2450793,224.7543697,-55.20952161,-34.30778523,-21.41651973,
              86.28842139,311.5751406,422.8051985,-154.6661358,-372.9805935,-493.199149])

y = np.array([0,23.7624369,14.25445424, 191.1453372,-23.76231614,-74.29022634,
              65.15338706,-94.52404367,-196.7940438,-295.3385045,-189.4094742,
              -268.4612737,-365.1576967,-147.156975,-120.6221787,-159.4755877,])

z = np.array([392.153576,407.6407392,-13.33628632,-392.6624282, 376.6665527,
              -40.79619526,-451.2933104,595.0140439,795.9953547,867.0494333,
              761.1477645,864.2323283,964.0904054,788.6428307,914.6668456,994.2208864])


ax = plt.subplot(projection='3d')  # 创建一个三维的绘图工程
ax.set_title('3d_pose')  # 设置本图名称
#ax.scatter(x, y, z, c='r')  # 绘制数据点 c: 'r'红色，'y'黄色，等颜色

ax.scatter(x, y, z, c='r')  # 绘制数据点 c: 'r'红色，'y'黄色，等颜色

ax.set_xlabel('X')  # 设置x坐标轴
ax.set_ylabel('Y')  # 设置y坐标轴
ax.set_zlabel('Z')  # 设置z坐标轴
ax.view_init(elev=10,  # 仰角
             azim=10  # 方位角
             )
plt.show()